export const fractional = [
  ['десятая', 'десятых', 'десятых'],
  ['сотая', 'сотых', 'сотых'],
  ['тысячная', 'тысячных', 'тысячных'],
  ['десятитысячная', 'десятитысячных', 'десятитысячных'],
  ['стотысячная', 'стотысячных', 'стотысячных'],
  ['миллионная', 'миллионных', 'миллионных'],
  ['десятимиллионная', 'десятимиллионных', 'десятимиллионных'],
  ['стомиллионная', 'стомиллионных', 'стомиллионных'],
  // ...
];

export const fractionalWordEndings = ['ная', 'ных', 'ных'];
export const fractionalWordPrefixes = ['', 'десяти', 'сто'];
